WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/vendor_commands.c
                case REQ_GET_CHANNEL_NAME: {
                    uint8_t ch = req->wValue & 0xFF;
                    if (ch >= NUM_CHANNELS) return false;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            channel_names[ch], PRESET_NAME_LEN);
                }
                case REQ_GET_OUTPUT_TYPE: {
                    uint8_t slot = (uint8_t)req->wValue;
                    if (slot >= NUM_SPDIF_INSTANCES) return false;
                    static uint8_t v;
                    v = output_types[slot];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_SET_OUTPUT_TYPE: {
                    /* Console sends this as a vendor IN with side effects:
                     *   wValue = (new_type << 8) | slot_index
                     *   wLength = 1 (status response)
                     * Mirror the RP convention so Console's
                     * "set_output_type → poll-for-status" flow works.
                     * Status returned is 0 (success) on valid input,
                     * 0xFF (generic fail) for any rejection. */
                    uint8_t slot     =  req->wValue       & 0xFF;
                    uint8_t new_type = (req->wValue >> 8) & 0xFF;
                    static uint8_t status;
                    if (slot < NUM_SPDIF_INSTANCES && new_type <= 1) {
                        if (output_types[slot] != new_type) {
                            output_types[slot] = new_type;
                            notify_param_write(
                                (uint16_t)(offsetof(WireBulkParams,
                                                    i2s_config.output_types)
                                           + slot),
                                1, &new_type);
                        }
                        status = 0;
                    } else {
                        status = 0xFF;
                    }
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &status, 1);
                }

                /* ---- I2S clock / pin config (Console probes these) ---- */
                case REQ_GET_I2S_BCK_PIN: {
                    static uint8_t v; v = i2s_bck_pin;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_MCK_ENABLE: {
                    static uint8_t v; v = i2s_mck_enabled ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_MCK_PIN: {
                    static uint8_t v; v = i2s_mck_pin;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_MCK_MULTIPLIER: {
                    static uint16_t v; v = i2s_mck_multiplier;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 2);
                }

                /* ---- Per-output pin (SPDIF/PDM GPIO assignments) ---- */
                case REQ_GET_OUTPUT_PIN: {
                    uint8_t out = (uint8_t)req->wValue;
                    if (out >= NUM_PIN_OUTPUTS) return false;
                    static uint8_t v; v = output_pins[out];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                /* ---- Identification ---- */
                case REQ_GET_SERIAL: {
                    /* M7g — 16-byte ASCII hex serial derived from the H7's
                     * 96-bit unique device ID at 0x1FF1E800. We encode the
                     * low 64 bits (8 bytes) as 16 hex chars — uniqueness is
                     * already guaranteed by the factory programming. The
                     * full 96-bit ID would need 24 chars, more than the
                     * Console's 16-byte buffer; the upper 32 bits are
                     * mostly wafer/lot info and rarely change between
                     * adjacent dies, so dropping them costs ~no entropy in
                     * practice. */
                    static uint8_t serial[16];
                    static int     serial_built = 0;
                    if (!serial_built) {
                        const uint32_t *uid = (const uint32_t *)0x1FF1E800UL;
                        uint64_t lo64 = ((uint64_t)uid[1] << 32) | uid[0];
                        static const char hex[] = "0123456789ABCDEF";
                        for (int i = 0; i < 16; ++i) {
                            int shift = (15 - i) * 4;
                            serial[i] = hex[(lo64 >> shift) & 0xF];
                        }
                        serial_built = 1;
                    }
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            serial, sizeof(serial));
                }

                /* ---- Core 1 mode (no Core 1 on H723) ---- */
                case REQ_GET_CORE1_MODE: {
                    static uint8_t v = 0; /* CORE1_MODE_IDLE — no second core */
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_CORE1_CONFLICT: {
                    /* No conflicts — single core handles everything. */
                    static uint8_t v = 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                /* ---- Master volume mode (independent / per-preset) ---- */
                case REQ_GET_MASTER_VOLUME_MODE: {
                    static uint8_t v = 0; /* MASTER_VOLUME_MODE_INDEPENDENT */
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                /* ---- SPDIF RX pin (no SPDIF RX in M7d) ---- */
                case REQ_GET_SPDIF_RX_PIN: {
                    static uint8_t v = 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                /* ---- Preset directory: empty (no preset storage in M7d) ----
                 *
                 *   [0-1] occupied bitmask u16 = 0  (no slots filled)
                 *   [2]   startup_mode = 0         (no auto-load)
                 *   [3]   default_slot = 0
                 *   [4]   last_active = 0
                 *   [5]   include_pins = 0
                 *   [6]   master_volume_mode = 0
                 */
                case REQ_PRESET_GET_DIR: {
                    /* M11: pull live directory from flash_storage.c.
                     * Layout (7 bytes):
                     *   [0..1] slot_occupied (u16, bit n = slot n filled)
                     *   [2]    startup_mode  (0 = specified, 1 = last_active)
                     *   [3]    default_slot  (0..9, applies when mode=0)
                     *   [4]    last_active   (last loaded/saved slot)
                     *   [5]    include_pins  (0/1)
                     *   [6]    master_volume_mode (0/1) */
                    static uint8_t dir[7];
                    uint16_t occ; uint8_t m, d, la, inc_pins, mv_mode;
                    preset_get_directory(&occ, &m, &d, &la, &inc_pins, &mv_mode);
                    dir[0] = (uint8_t)(occ & 0xFF);
                    dir[1] = (uint8_t)(occ >> 8);
                    dir[2] = m;
                    dir[3] = d;
                    dir[4] = la;
                    dir[5] = inc_pins;
                    dir[6] = mv_mode;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            dir, sizeof(dir));
                }
                case REQ_PRESET_GET_ACTIVE: {
                    static uint8_t v;
                    v = preset_get_active();
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_PRESET_GET_STARTUP: {
                    /* 3 bytes: startup_mode, default_slot, include_pins. */
                    static uint8_t v[3];
                    uint16_t occ; uint8_t la, mv_mode;
                    preset_get_directory(&occ, &v[0], &v[1], &la, &v[2], &mv_mode);
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            v, sizeof(v));
                }
                case REQ_PRESET_GET_INCLUDE_PINS: {
                    static uint8_t v;
                    uint16_t occ; uint8_t m, d, la, mv_mode;
                    preset_get_directory(&occ, &m, &d, &la, &v, &mv_mode);
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_PRESET_GET_NAME: {
                    /* wValue = slot index (0..9). Returns 32-byte name. */
                    static char nm[PRESET_NAME_LEN];
                    uint8_t slot = req->wValue & 0xFF;
                    if (preset_get_name(slot, nm) != 0) {
                        memset(nm, 0, sizeof(nm));
                    }
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            nm, sizeof(nm));
                }

                /* Console wraps SAVE / LOAD / DELETE as GETs that return a
                 * 1-byte status (PRESET_OK or PRESET_ERR_*). The device
                 * performs the action synchronously and ships the result
                 * back in the data stage of the same control transfer. */
                case REQ_PRESET_SAVE: {
                    extern volatile uint8_t last_preset_result;
                    static uint8_t status;
                    status = preset_save(req->wValue & 0xFF);
                    last_preset_result = status;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &status, 1);
                }
                case REQ_PRESET_LOAD: {
                    extern volatile uint8_t last_preset_result;
                    static uint8_t status;
                    status = preset_load(req->wValue & 0xFF);
                    last_preset_result = status;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &status, 1);
                }
                case REQ_PRESET_DELETE: {
                    extern volatile uint8_t last_preset_result;
                    static uint8_t status;
                    status = preset_delete(req->wValue & 0xFF);
                    last_preset_result = status;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &status, 1);
                }

                /* ---- Clear clips ---- */
                case REQ_CLEAR_CLIPS: {
                    static uint16_t f;
                    f = global_status.clip_flags;
                    global_status.clip_flags = 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &f, 2);
                }
                case REQ_GET_EQ_PARAM: {
                    /* wValue encodes (channel<<8) | (band<<4) | param.
                     *   param: 0=type, 1=freq(f32), 2=Q(f32), 3=gain_db(f32), 4=bypass */
                    uint8_t channel = (req->wValue >> 8) & 0xFF;
                    uint8_t band    = (req->wValue >> 4) & 0x0F;
                    uint8_t param   =  req->wValue       & 0x0F;
                    if (channel >= NUM_CHANNELS
                        || band >= channel_band_counts[channel]) return false;
                    static uint32_t resp;
                    EqParamPacket *p = &filter_recipes[channel][band];
                    switch (param) {
                        case 0: resp = (uint32_t)p->type; break;
                        case 1: memcpy(&resp, &p->freq,    4); break;
                        case 2: memcpy(&resp, &p->Q,       4); break;
                        case 3: memcpy(&resp, &p->gain_db, 4); break;
                        case 4: resp = (p->bypass == 1) ? 1u : 0u; break;
                        default: return false;
                    }
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &resp, 4);
                }
                case REQ_GET_BAND_BYPASS: {
                    /* wValue = (channel<<8) | band — payload 1 byte. */
                    uint8_t ch   = (req->wValue >> 8) & 0xFF;
                    uint8_t band =  req->wValue       & 0xFF;
                    if (ch >= NUM_CHANNELS
                        || band >= channel_band_counts[ch]) return false;
                    static uint8_t v;
                    v = (filter_recipes[ch][band].bypass == 1) ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &v, 1);
                }
                default:
                    return false;
            }
        }

        /* SET path — record context, set up DATA-stage receive. */
        vendor_last_request = req->bRequest;
        vendor_last_wValue  = req->wValue;
        vendor_last_wLength = req->wLength;

        if (req->bRequest == REQ_SET_ALL_PARAMS
            && req->wLength == sizeof(WireBulkParams)) {
            return tud_control_xfer(rhport,
                                    (tusb_control_request_t *)req,
                                    bulk_param_buf, req->wLength);
        }

        if (req->wLength == 0) {
            /* Zero-length SET — slot/index lives in wValue, no payload.
             * Dispatch action here (no DATA stage will fire), then ack. */
            extern volatile uint8_t last_preset_result;
            uint8_t slot = req->wValue & 0xFF;
            switch (req->bRequest) {
                case REQ_PRESET_SAVE:
                    last_preset_result = preset_save(slot);
                    break;
                case REQ_PRESET_LOAD:
                    last_preset_result = preset_load(slot);
                    break;
                case REQ_PRESET_DELETE:
                    last_preset_result = preset_delete(slot);
                    break;
                case REQ_PRESET_SET_STARTUP: {
                    uint8_t mode = (req->wValue >> 8) & 0xFF;
                    uint8_t dflt =  req->wValue       & 0xFF;
                    last_preset_result = preset_set_startup(mode, dflt);
                    break;
                }
                default: break;
            }
            return tud_control_status(rhport, (tusb_control_request_t *)req);
        }

        /* All other small SETs land in vendor_rx_buf for the DATA-stage
         * dispatcher to consume. */
        if (req->wLength <= sizeof(vendor_rx_buf)) {
            return tud_control_xfer(rhport,
                                    (tusb_control_request_t *)req,
                                    vendor_rx_buf, req->wLength);
        }

