WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/vendor_commands.c
            case REQ_SET_CROSSFEED:
                if (vendor_last_wLength >= 1) {
                    crossfeed_config.enabled = (vendor_rx_buf[0] != 0);
                    crossfeed_update_pending = true;
                    uint8_t v = crossfeed_config.enabled ? 1 : 0;
                    notify_param_write(offsetof(WireBulkParams, crossfeed.enabled),
                                       1, &v);
                }
                break;
            case REQ_SET_CROSSFEED_PRESET:
                if (vendor_last_wLength >= 1) {
                    uint8_t p = vendor_rx_buf[0];
                    if (p <= CROSSFEED_PRESET_CUSTOM) {
                        crossfeed_config.preset = p;
                        crossfeed_update_pending = true;
                        notify_param_write(offsetof(WireBulkParams, crossfeed.preset),
                                           1, &p);
                    }
                }
                break;
            case REQ_SET_CROSSFEED_FREQ:
                if (vendor_last_wLength >= 4) {
                    float v; memcpy(&v, vendor_rx_buf, 4);
                    if (v < CROSSFEED_FREQ_MIN) v = CROSSFEED_FREQ_MIN;
                    if (v > CROSSFEED_FREQ_MAX) v = CROSSFEED_FREQ_MAX;
                    crossfeed_config.custom_fc = v;
                    if (crossfeed_config.preset == CROSSFEED_PRESET_CUSTOM)
                        crossfeed_update_pending = true;
                    notify_param_write(offsetof(WireBulkParams, crossfeed.custom_fc),
                                       sizeof(float), &v);
                }
                break;
            case REQ_SET_CROSSFEED_FEED:
                if (vendor_last_wLength >= 4) {
                    float v; memcpy(&v, vendor_rx_buf, 4);
                    if (v < CROSSFEED_FEED_MIN) v = CROSSFEED_FEED_MIN;
                    if (v > CROSSFEED_FEED_MAX) v = CROSSFEED_FEED_MAX;
                    crossfeed_config.custom_feed_db = v;
                    if (crossfeed_config.preset == CROSSFEED_PRESET_CUSTOM)
                        crossfeed_update_pending = true;
                    notify_param_write(offsetof(WireBulkParams, crossfeed.custom_feed_db),
                                       sizeof(float), &v);
                }
                break;
            case REQ_SET_CROSSFEED_ITD:
                if (vendor_last_wLength >= 1) {
                    crossfeed_config.itd_enabled = (vendor_rx_buf[0] != 0);
                    crossfeed_update_pending = true;
                    uint8_t v = crossfeed_config.itd_enabled ? 1 : 0;
                    notify_param_write(offsetof(WireBulkParams, crossfeed.itd_enabled),
                                       1, &v);
                }
                break;

            case REQ_SET_LEVELLER_ENABLE:
                if (vendor_last_wLength >= 1) {
                    leveller_config.enabled = (vendor_rx_buf[0] != 0);
                    leveller_update_pending = true;
                    leveller_reset_pending  = true;
                    uint8_t v = leveller_config.enabled ? 1 : 0;
                    notify_param_write(offsetof(WireBulkParams, leveller.enabled),
                                       1, &v);
                }
                break;
            case REQ_SET_LEVELLER_AMOUNT:
                if (vendor_last_wLength >= 4) {
                    float v; memcpy(&v, vendor_rx_buf, 4);
                    if (v < LEVELLER_AMOUNT_MIN) v = LEVELLER_AMOUNT_MIN;
                    if (v > LEVELLER_AMOUNT_MAX) v = LEVELLER_AMOUNT_MAX;
                    leveller_config.amount = v;
                    leveller_update_pending = true;
                    notify_param_write(offsetof(WireBulkParams, leveller.amount),
                                       sizeof(float), &v);
                }
                break;
            case REQ_SET_LEVELLER_SPEED:
                if (vendor_last_wLength >= 1) {
                    uint8_t s = vendor_rx_buf[0];
                    if (s < LEVELLER_SPEED_COUNT) {
                        leveller_config.speed = s;
                        leveller_update_pending = true;
                        notify_param_write(offsetof(WireBulkParams, leveller.speed),
                                           1, &s);
                    }
                }
                break;
            case REQ_SET_LEVELLER_MAX_GAIN:
                if (vendor_last_wLength >= 4) {
                    float v; memcpy(&v, vendor_rx_buf, 4);
                    if (v < LEVELLER_MAX_GAIN_MIN) v = LEVELLER_MAX_GAIN_MIN;
                    if (v > LEVELLER_MAX_GAIN_MAX) v = LEVELLER_MAX_GAIN_MAX;
                    leveller_config.max_gain_db = v;
                    leveller_update_pending = true;
                    notify_param_write(offsetof(WireBulkParams, leveller.max_gain_db),
                                       sizeof(float), &v);
                }
                break;
            case REQ_SET_LEVELLER_LOOKAHEAD:
                if (vendor_last_wLength >= 1) {
                    leveller_config.lookahead = (vendor_rx_buf[0] != 0);
                    leveller_update_pending = true;
                    leveller_reset_pending  = true;
                    uint8_t v = leveller_config.lookahead ? 1 : 0;
                    notify_param_write(offsetof(WireBulkParams, leveller.lookahead),
                                       1, &v);
                }
                break;
            case REQ_SET_LEVELLER_GATE:
                if (vendor_last_wLength >= 4) {
                    float v; memcpy(&v, vendor_rx_buf, 4);
                    if (v < LEVELLER_GATE_MIN) v = LEVELLER_GATE_MIN;
                    if (v > LEVELLER_GATE_MAX) v = LEVELLER_GATE_MAX;
                    leveller_config.gate_threshold_db = v;
                    leveller_update_pending = true;
                    notify_param_write(offsetof(WireBulkParams, leveller.gate_threshold_db),
                                       sizeof(float), &v);
                }
                break;

            case REQ_SET_CHANNEL_NAME: {
                uint8_t ch = vendor_last_wValue & 0xFF;
                if (ch < NUM_CHANNELS && vendor_last_wLength > 0) {
                    memset(channel_names[ch], 0, PRESET_NAME_LEN);
                    size_t copy_len = vendor_last_wLength < (PRESET_NAME_LEN - 1)
                                    ? vendor_last_wLength : (PRESET_NAME_LEN - 1);
                    memcpy(channel_names[ch], vendor_rx_buf, copy_len);
                    /* Push the FULL 32-byte name slot — easier than carving
                     * a partial diff for variable-length string updates. */
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, channel_names)
                                   + ch * WIRE_NAME_LEN),
                        WIRE_NAME_LEN, channel_names[ch]);
                }
                break;
            }
            case REQ_SET_OUTPUT_TYPE: {
                uint8_t slot     =  vendor_last_wValue       & 0xFF;
                uint8_t new_type = (vendor_last_wValue >> 8) & 0xFF;
                if (slot < NUM_SPDIF_INSTANCES && new_type <= 1) {
                    output_types[slot] = new_type;
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, i2s_config.output_types)
                                   + slot),
                        1, &new_type);
                }
                break;
            }

            /* ---- I2S clock + pin config ---- */
            case REQ_SET_I2S_BCK_PIN:
                if (vendor_last_wLength >= 1) i2s_bck_pin = vendor_rx_buf[0];
                break;
            case REQ_SET_MCK_ENABLE:
                if (vendor_last_wLength >= 1) i2s_mck_enabled = (vendor_rx_buf[0] != 0);
                break;
            case REQ_SET_MCK_PIN:
                if (vendor_last_wLength >= 1) i2s_mck_pin = vendor_rx_buf[0];
                break;
            case REQ_SET_MCK_MULTIPLIER:
                if (vendor_last_wLength >= 2)
                    memcpy((void *)&i2s_mck_multiplier, vendor_rx_buf, 2);
                break;

            case REQ_SET_OUTPUT_PIN: {
                uint8_t out = vendor_last_wValue & 0xFF;
                if (out < NUM_PIN_OUTPUTS && vendor_last_wLength >= 1)
                    output_pins[out] = vendor_rx_buf[0];
                break;
            }

